# 1.Pandas SERIES

In [1]:

import pandas as pd
import numpy as np
l=[1,2,3,4]

In [2]:
m=[1,2,3,3]
a=np.array(m)
Dictionary={"a":10,"b":20,"c":30}

In [7]:
pd.Series(m,l)

1    1
2    2
3    3
4    3
dtype: int64

In [5]:
pd.Series(Dictionary)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series([sum,len])

0    <built-in function sum>
1    <built-in function len>
dtype: object

In [9]:
s1=pd.Series([1,2,3,4],["india","USA",'germany','japan'])

In [10]:
s1

india      1
USA        2
germany    3
japan      4
dtype: int64

In [11]:
s2=pd.Series([1,2,3,4],["india","africa",'germany','japan'])

In [12]:
s2

india      1
africa     2
germany    3
japan      4
dtype: int64

In [13]:
s1+s2

USA        NaN
africa     NaN
germany    6.0
india      2.0
japan      8.0
dtype: float64

# 2. Pandas DATAFRAME

In [14]:
from  numpy.random import randn

In [15]:
np.random.seed(101)

In [16]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['V','W','X','Y'])

In [17]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df["W"]

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

WE also can do to grab series from dataframe is:

In [19]:
df.W

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

In [20]:
df[["W","Y"]]

          W         Y
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

TO add new column in dataframe

In [21]:
df["new"]=df["W"]+df["Y"]

In [22]:
df

          V         W         X         Y       new
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

to drop any column from the dataframe

In [23]:
df.drop("new",axis=1,inplace=True)

In [24]:
df

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

df.shape define the shape of dataframe

In [25]:
df.shape

(5, 4)

for grabing rows from dataframe we use "loc" property it is a first way to grab rows from dataframe it uses row name

In [26]:
df.loc["A"]

V    2.706850
W    0.628133
X    0.907969
Y    0.503826
Name: A, dtype: float64

for grabing rows from dataframe we use "iloc" property it is a second way to grab rows from dataframe it uses row index
in ex- suppose we want to grab the value of row "C" so we use the index value 2

In [27]:
df.iloc[2]

V   -2.018168
W    0.740122
X    0.528813
Y   -0.589001
Name: C, dtype: float64

suppose we want to grab single value in a dataframe

In [28]:
df.loc["A","W"]

0.6281327087844596

In [29]:
df.loc[["A","B"],["W","Y"]]

          W         Y
A  0.628133  0.503826
B -0.319318  0.605965

conditional operator in Dataframe gives Boolean values

In [30]:
b=df>1

In [31]:
b

       V      W      X      Y
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

it only shows true values

In [32]:
df[b]

         V         W         X   Y
A  2.70685       NaN       NaN NaN
B      NaN       NaN       NaN NaN
C      NaN       NaN       NaN NaN
D      NaN       NaN       NaN NaN
E      NaN  1.978757  2.605967 NaN

In [33]:
df[df["W"]>0]

          V         W         X         Y
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df[df["Y"]<0]

          V         W         X         Y
C -2.018168  0.740122  0.528813 -0.589001

If there are two condition is present we use "&" or "|" . We an not use "and" and "or" because and compare boolean like true or false

In [35]:
df[(df["Y"]>0) &(df["W"]>1)]

          V         W         X         Y
E  0.190794  1.978757  2.605967  0.683509

To reset the index we reset_index() it is not occur in original dataframe if we want to reset index   iin original dataframe e inplace="False"

In [36]:
df.reset_index()

  index         V         W         X         Y
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

to add any new column

In [37]:
newindex="c b d e f".split()#it is a new method two create a list
df["new column"]=newindex

In [38]:
df

          V         W         X         Y new column
A  2.706850  0.628133  0.907969  0.503826          c
B  0.651118 -0.319318 -0.848077  0.605965          b
C -2.018168  0.740122  0.528813 -0.589001          d
D  0.188695 -0.758872 -0.933237  0.955057          e
E  0.190794  1.978757  2.605967  0.683509          f

to set new index in dataframe we use "set_index"

In [39]:
df.set_index("new column")

                   V         W         X         Y
new column
c           2.706850  0.628133  0.907969  0.503826
b           0.651118 -0.319318 -0.848077  0.605965
d          -2.018168  0.740122  0.528813 -0.589001
e           0.188695 -0.758872 -0.933237  0.955057
f           0.190794  1.978757  2.605967  0.683509

# multiindex dataframe

In [40]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [41]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [42]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [43]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

adding new group in dataframe we use "index.names"

In [44]:
df.index.names=['group','name']

In [45]:
df

                   A         B
group name
G1    1     0.302665  1.693723
      2    -1.706086 -1.159119
      3    -0.134841  0.390528
G2    1     0.166905  0.184502
      2     0.807706  0.072960
      3     0.638787  0.329646

In [46]:
df.xs(1,level="name")

              A         B
group
G1     0.302665  1.693723
G2     0.166905  0.184502

In [47]:
d={"A":[1,2,np.nan],"B":[2,3,np.nan],"C":[3,4,5]}

In [48]:
df=pd.DataFrame(d)

In [49]:
df

     A    B  C
0  1.0  2.0  3
1  2.0  3.0  4
2  NaN  NaN  5

to drop any missing or nul value in dataframe we use "dropna" default its axis is zero which remove row but if we want to remove column then we use axis=1

In [50]:
df.dropna()

     A    B  C
0  1.0  2.0  3
1  2.0  3.0  4

In [51]:
df.dropna(axis=1)

   C
0  3
1  4
2  5

In [52]:
df.dropna(thresh=2)#it shows atleast two  non zero element iinn row

     A    B  C
0  1.0  2.0  3
1  2.0  3.0  4

In [53]:
df.dropna(axis=1,thresh=2)#it shows atleast two non zero values in column

     A    B  C
0  1.0  2.0  3
1  2.0  3.0  4
2  NaN  NaN  5

In [54]:
df

     A    B  C
0  1.0  2.0  3
1  2.0  3.0  4
2  NaN  NaN  5

if we want to fill these missing values we use "filling" methods

In [55]:
df.fillna(value=1)

     A    B  C
0  1.0  2.0  3
1  2.0  3.0  4
2  1.0  1.0  5

In [56]:
  df["A"]

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [57]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [58]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}

In [59]:
df=pd.DataFrame(data)

In [60]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [61]:
d=df.groupby('Company')

In [62]:
d

In [63]:
d.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [64]:
d.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [65]:
d.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [66]:
d.count()#no.of instances present

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [67]:
d.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [68]:
d.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [69]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [70]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together:Merging,Joining and concatenating. In thiss lecture wee will ddiscuss thesse 3 methoods with examples

In [71]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                 index=[0,1,2,3])

In [72]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']},
                 index=[4,5,6,7])

In [73]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                  'B':['B8','B9','B10','B11'],
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']},
                 index=[8,9,10,11])

In [74]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [75]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [76]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation

concatenation basically glues together Dataframes.Keep in mind that dimensions should match along the axis you are concatenating on.You can use pd.concat and pass in a list of DataFrames to concatenate together

In [77]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [78]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [79]:
l=pd.DataFrame({'key':['k0','k1','k2','k3'],
                  'A':['B8','B9','B10','B11'],
                  'B':['C8','C9','C10','C11'],
                  }
                 )

r=pd.DataFrame({'key':['k0','k1','k2','k3'],
                  'D':['B4','B5','B6','B7'],
                  'E':['C4','C5','C6','C7'],
                  }
                )

In [80]:
l

  key    A    B
0  k0   B8   C8
1  k1   B9   C9
2  k2  B10  C10
3  k3  B11  C11

In [81]:
r

  key   D   E
0  k0  B4  C4
1  k1  B5  C5
2  k2  B6  C6
3  k3  B7  C7

# Merging

The merge function allows you to merge DataFrames together using a similar logics as merging SQL Tables together.for example:

In [82]:
pd.merge(l,r,how='inner',on='key')

  key    A    B   D   E
0  k0   B8   C8  B4  C4
1  k1   B9   C9  B5  C5
2  k2  B10  C10  B6  C6
3  k3  B11  C11  B7  C7

In [83]:
l=pd.DataFrame({'key1':['k0','k1','k2','k3'],
                'key2':['k0','k1','k2','k3'],
                  'A':['B8','B9','B10','B11'],
                  'B':['C8','C9','C10','C11'],
                  }
                 )

r=pd.DataFrame({'key1':['k0','k1','k2','k3'],
                'key2':['k0','k1','k2','k3'],
                  'D':['B4','B5','B6','B7'],
                  'E':['C4','C5','C6','C7'],
                  }
                )

In [84]:
pd.merge(l,r,how='outer',on=['key1','key2'])

  key1 key2    A    B   D   E
0   k0   k0   B8   C8  B4  C4
1   k1   k1   B9   C9  B5  C5
2   k2   k2  B10  C10  B6  C6
3   k3   k3  B11  C11  B7  C7

In [85]:
pd.merge(l,r,how='left',on=['key1','key2'])

  key1 key2    A    B   D   E
0   k0   k0   B8   C8  B4  C4
1   k1   k1   B9   C9  B5  C5
2   k2   k2  B10  C10  B6  C6
3   k3   k3  B11  C11  B7  C7

# Joining

Joining is a convenient method for combining the columns of two potentially different-indexed DataFrames into a single result DataFrame.

In [86]:
l=pd.DataFrame({
                  'A':['B8','B9','B10','B11'],
                  'B':['C8','C9','C10','C11'],
                  },
    index=['k0','k1','k2','k3'],
                 )

r=pd.DataFrame({
                  'D':['B4','B5','B6','B7'],
                  'E':['C4','C5','C6','C7'],
                  },
               index=['k0','k3','k4','k5'],
               
                )

In [87]:
l.join(r)

      A    B    D    E
k0   B8   C8   B4   C4
k1   B9   C9  NaN  NaN
k2  B10  C10  NaN  NaN
k3  B11  C11   B5   C5

In [88]:
l.join(r,how='outer')

      A    B    D    E
k0   B8   C8   B4   C4
k1   B9   C9  NaN  NaN
k2  B10  C10  NaN  NaN
k3  B11  C11   B5   C5
k4  NaN  NaN   B6   C6
k5  NaN  NaN   B7   C7

In [89]:
l.join(r,how='inner')

      A    B   D   E
k0   B8   C8  B4  C4
k3  B11  C11  B5  C5

In [90]:
l.join(r,how='right')

      A    B   D   E
k0   B8   C8  B4  C4
k3  B11  C11  B5  C5
k4  NaN  NaN  B6  C6
k5  NaN  NaN  B7  C7

In [91]:
l.join(r,how='left')

      A    B    D    E
k0   B8   C8   B4   C4
k1   B9   C9  NaN  NaN
k2  B10  C10  NaN  NaN
k3  B11  C11   B5   C5

# Operation on DataFrame

In [92]:
df=pd.DataFrame({'col1':[1,2,3,4],
                'col2':[444,555,666,444],
                'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [93]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [94]:
len(df['col2'].unique())#this tells us how many unique value is present

3

In [95]:
df['col2'].nunique()#this also give the unique values in a coolumn

3

In [96]:
df['col2'].value_counts()#occurence of any value in a column

444    2
555    1
666    1
Name: col2, dtype: int64

In [97]:
 df[(df['col1']>2)]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [98]:
 df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [99]:
#if we want to apply user defined function on dataframe
def times2(x):
        return x*2
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [100]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [101]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [102]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [103]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [104]:
df.sort_values('col1')#sorting of columns on the basis of column 1

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [105]:
df.sort_values('col2')#sorting of columns on the basis of column 2

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [106]:
df.sort_values('col3')#sorting of columns on the basis of column 3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [107]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [108]:
df=pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
                'B':['one','one','two','two','one','one'],
                'C':['X','Y','X','Y','X','Y'],
                'D':[1,3,2,5,4,1]})

In [109]:
df

     A    B  C  D
0  foo  one  X  1
1  foo  one  Y  3
2  foo  two  X  2
3  bar  two  Y  5
4  bar  one  X  4
5  bar  one  Y  1

In [110]:
 df.pivot_table(values='D',index=['A','B'],columns=["C"])

C          X    Y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data input and output

In [ ]:
pd.read_csv('example.csv')